# Pandas Part-3

Advanced Numpy covering topics like :<br>

7. <a href="#OP">Operations </a>  
8. <a href="#IO">Input and Output  </a>

In [60]:
import numpy as np
import pandas as pd

In [63]:
%%HTML
<style type="text/css">
table.dataframe td, table.dataframe th {
    border-style: solid;
}

## <a id="OP">Operations</a> :

In [26]:
df=pd.DataFrame({'roll no':[101,102,103,104],'Name':['Aayush','Aayush','Shaira','Abhir']})

In [27]:
df

   roll no    Name
0      101  Aayush
1      102  Aayush
2      103  Shaira
3      104   Abhir

In [28]:
df['Name'].unique()

array(['Aayush', 'Shaira', 'Abhir'], dtype=object)

In [29]:
df['Name'].nunique()

3

In [30]:
df['Name'].value_counts()

Aayush    2
Shaira    1
Abhir     1
Name: Name, dtype: int64

In [31]:
def rol(x):
    return x+100;

In [32]:
df['roll no'].apply(rol)

0    201
1    202
2    203
3    204
Name: roll no, dtype: int64

In [33]:
df.drop('Name',axis=1)

   roll no
0      101
1      102
2      103
3      104

In [34]:
df

   roll no    Name
0      101  Aayush
1      102  Aayush
2      103  Shaira
3      104   Abhir

In [35]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [36]:
df.columns

Index(['roll no', 'Name'], dtype='object')

In [37]:
df.sort_values(by='Name')

   roll no    Name
0      101  Aayush
1      102  Aayush
3      104   Abhir
2      103  Shaira

In [43]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df_2 = pd.DataFrame(data)

In [44]:
df_2

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [62]:

df_2.pivot_table(values=['D'],index=['A','B'],columns=['C'])

           D
C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

## <a id="IO">Input and Output</a> :

go to command prompt first and install the following :<br>
    I installed it via anaconda prompt ,<br>
<code>conda install sqlalchemy
 conda install lxml
 conda install html5lib
 conda install BeautifulSoup4</code>

<b> WE can import and export data using pandas from the following types:
    1. CSV
    2. Excel
    3. HTML
    4. SQL (not covered in this section)

In [64]:
pwd
#to get working directory

'C:\\Users\\Gandhi\\python\\Pandas'

### Reading a File

In [85]:
pd.read_csv('C:\\Users\\Gandhi\\Desktop\\test.csv')
#note while adding directory location put double "\" as in put \\ instead of 
# single \ as python takes it as escape and not path.

     Name  Class  age
0  Aayush      5   21
1   Ridhi      7   18
2    Test      5   54
3  Aayush      5   21
4   Ridhi      7   18
5    Test      5   54
6  Aayush      5   21
7   Ridhi      7   18
8    Test      5   54
9  Aayush      5   21

In [90]:
df=pd.read_csv('C:\\Users\\Gandhi\\Desktop\\test.csv')
#reading and storing the dataframe as df

performing operations on df
here we removed duplicates (only unique left) from the name column   
using <code>.drop_duplicates(subset)</code>

In [89]:
df = df.drop_duplicates(subset = ["Name"])
df

     Name  Class  age
0  Aayush      5   21
1   Ridhi      7   18
2    Test      5   54

### Saving a file

In [87]:
df.to_csv('C:\\Users\\Gandhi\\Desktop\\output.csv')
#this will save the df file as it is

lets check what got saved

![output](output.jpg)

We can see the in this case the index got saved along with the dataframe , but since index is not always required, lets see how to save without index

In [88]:
df.to_csv('C:\\Users\\Gandhi\\Desktop\\output2.csv',index=False)

checking the saved file we get

![output](output2.jpg)

### For Excel files:
WE can do the same for excel files too   
1. Install <code> conda install xlrd</code>  
2. use <code> pd.read_excel(path,sheetname)</code>
3. perform operations 
4. to  save <code> df.to_excel(path,sheet_name)</code>

### For HTML files:
first import data from a link which contains tables

In [92]:
data=pd.read_html('https://info.sice.indiana.edu/~hrosenba/Demo/Demo4.html')

As an HTML page may contain more than one table we need to specify which one we want by slicing the dataframe as follows

In [95]:
data[0]
#we want the first table from that page hence we used 0

        Unnamed: 0 Students Faculty Babies Cats
0  Understand html      60%     55%     5%   4%
1   Sort of get it      30%     30%    10%   5%
2     Don't get it       8%      5%    80%  21%
3       Chase mice       2%     10%     5%  70%

we can now save this to any format like to excel

In [96]:
html_data=data[0]
html_data.to_excel('C:\\Users\\Gandhi\\Desktop\\output_html.xlsx')

![output](output_html.jpg)